; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-7-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p0-10 - location
	p0-11 - location
	p1-4 - location
	p3-0 - location
	p4-0 - location
	p4-3 - location
	p4-6 - location
	p4-8 - location
	p4-12 - location
	p6-7 - location
	p6-9 - location
	p6-12 - location
	p7-2 - location
	p7-8 - location
	p9-1 - location
	p9-5 - location
	p9-8 - location
	p10-2 - location
	p10-6 - location
	p10-9 - location
	p11-3 - location
	p11-4 - location
	p12-3 - location
	p12-11 - location
	)
	(:init
	(at driver1 s7)
	(at driver2 s5)
	(at driver3 s9)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s4)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s1)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s6)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at package1 s4)
	(at package2 s4)
	(at package3 s9)
	(at package4 s2)
	(at package5 s7)
	(at package6 s3)
	(at package7 s12)
	(at package8 s4)
	(at package9 s6)
	(path s0 p0-10)
	(path p0-10 s0)
	(path s10 p0-10)
	(path p0-10 s10)
	(path s0 p0-11)
	(path p0-11 s0)
	(path s11 p0-11)
	(path p0-11 s11)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(path s4 p4-12)
	(path p4-12 s4)
	(path s12 p4-12)
	(path p4-12 s12)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(path s6 p6-12)
	(path p6-12 s6)
	(path s12 p6-12)
	(path p6-12 s12)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(path s9 p9-1)
	(path p9-1 s9)
	(path s1 p9-1)
	(path p9-1 s1)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(path s9 p9-8)
	(path p9-8 s9)
	(path s8 p9-8)
	(path p9-8 s8)
	(path s10 p10-2)
	(path p10-2 s10)
	(path s2 p10-2)
	(path p10-2 s2)
	(path s10 p10-6)
	(path p10-6 s10)
	(path s6 p10-6)
	(path p10-6 s6)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(path s11 p11-3)
	(path p11-3 s11)
	(path s3 p11-3)
	(path p11-3 s3)
	(path s11 p11-4)
	(path p11-4 s11)
	(path s4 p11-4)
	(path p11-4 s4)
	(path s12 p12-3)
	(path p12-3 s12)
	(path s3 p12-3)
	(path p12-3 s3)
	(path s12 p12-11)
	(path p12-11 s12)
	(path s11 p12-11)
	(path p12-11 s11)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 87)
	(= (time-to-drive s8 s0) 87)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 83)
	(= (time-to-drive s9 s0) 83)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 47)
	(= (time-to-drive s11 s0) 47)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 75)
	(= (time-to-drive s3 s1) 75)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 17)
	(= (time-to-drive s10 s2) 17)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 69)
	(= (time-to-drive s0 s3) 69)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 45)
	(= (time-to-drive s4 s3) 45)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 60)
	(= (time-to-drive s9 s3) 60)
	(link s3 s11)
	(link s11 s3)
	(= (time-to-drive s3 s11) 22)
	(= (time-to-drive s11 s3) 22)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 28)
	(= (time-to-drive s2 s4) 28)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 94)
	(= (time-to-drive s6 s4) 94)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 25)
	(= (time-to-drive s1 s5) 25)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 39)
	(= (time-to-drive s2 s5) 39)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 32)
	(= (time-to-drive s4 s5) 32)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 28)
	(= (time-to-drive s8 s5) 28)
	(link s5 s11)
	(link s11 s5)
	(= (time-to-drive s5 s11) 29)
	(= (time-to-drive s11 s5) 29)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 5)
	(= (time-to-drive s5 s6) 5)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 11)
	(= (time-to-drive s7 s6) 11)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 31)
	(= (time-to-drive s10 s6) 31)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 1)
	(= (time-to-drive s2 s7) 1)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 75)
	(= (time-to-drive s5 s7) 75)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 84)
	(= (time-to-drive s11 s7) 84)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 51)
	(= (time-to-drive s4 s8) 51)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 94)
	(= (time-to-drive s7 s8) 94)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 61)
	(= (time-to-drive s2 s9) 61)
	(link s10 s1)
	(link s1 s10)
	(= (time-to-drive s10 s1) 57)
	(= (time-to-drive s1 s10) 57)
	(link s10 s3)
	(link s3 s10)
	(= (time-to-drive s10 s3) 87)
	(= (time-to-drive s3 s10) 87)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 81)
	(= (time-to-drive s7 s10) 81)
	(link s11 s1)
	(link s1 s11)
	(= (time-to-drive s11 s1) 29)
	(= (time-to-drive s1 s11) 29)
	(link s11 s4)
	(link s4 s11)
	(= (time-to-drive s11 s4) 75)
	(= (time-to-drive s4 s11) 75)
	(link s11 s8)
	(link s8 s11)
	(= (time-to-drive s11 s8) 3)
	(= (time-to-drive s8 s11) 3)
	(link s11 s10)
	(link s10 s11)
	(= (time-to-drive s11 s10) 15)
	(= (time-to-drive s10 s11) 15)
	(link s11 s12)
	(link s12 s11)
	(= (time-to-drive s11 s12) 57)
	(= (time-to-drive s12 s11) 57)
	(link s12 s8)
	(link s8 s12)
	(= (time-to-drive s12 s8) 49)
	(= (time-to-drive s8 s12) 49)
	(link s12 s9)
	(link s9 s12)
	(= (time-to-drive s12 s9) 90)
	(= (time-to-drive s9 s12) 90)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s9)
	(at driver3 s5)
	(at truck1 s12)
	(at truck2 s10)
	(at truck3 s4)
	(at truck4 s9)
	(at truck6 s1)
	(at truck7 s4)
	(at package2 s4)
	(at package3 s0)
	(at package4 s1)
	(at package6 s9)
	(at package7 s10)
	(at package8 s1)
	))

(:metric minimize (+ (* 3 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver3 s9 p9-5)
   deleted: (at driver3 s9)
   added: (at driver3 p9-5)
   goals met: 2 of 14
2. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 14
3. (drive-truck truck2 s5 s11 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s11)
   changed: (fuel-used) from 0 to 290
   goals met: 2 of 14
4. (drive-truck truck2 s11 s3 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s3)
   changed: (fuel-used) from 290 to 510
   goals met: 2 of 14
5. (walk driver3 p9-5 s5)
   deleted: (at driver3 p9-5)
   added: (at driver3 s5)
   goals met: 3 of 14
6. (walk driver1 s7 p6-7)
   deleted: (at driver1 s7)
   added: (at driver1 p6-7)
   goals met: 3 of 14
7. (drive-truck truck2 s3 s9 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s9)
   changed: (fuel-used) from 510 to 1110
   goals met: 3 of 14
8. (load-truck package3 truck2 s9)
   deleted: (at package3 s9)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 3 of 14
9. (drive-truck truck2 s9 s3 driver2)
   deleted: (at truck2 s9)
   added: (at truck2 s3)
   changed: (fuel-used) from 1110 to 1770
   goals met: 3 of 14
10. (walk driver1 p6-7 s6)
   deleted: (at driver1 p6-7)
   added: (at driver1 s6)
   goals met: 3 of 14
11. (load-truck package6 truck2 s3)
   deleted: (at package6 s3)
   added: (in package6 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 3 of 14
12. (drive-truck truck2 s3 s0 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 1770 to 2667
   goals met: 3 of 14
13. (unload-truck package3 truck2 s0)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 4 of 14
14. (board-truck driver1 truck7 s6)
   deleted: (at driver1 s6) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 4 of 14
15. (drive-truck truck2 s0 s9 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s9)
   changed: (fuel-used) from 2667 to 3580
   goals met: 4 of 14
16. (unload-truck package6 truck2 s9)
   deleted: (in package6 truck2)
   added: (at package6 s9)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 5 of 14
17. (drive-truck truck2 s9 s0 driver2)
   deleted: (at truck2 s9)
   added: (at truck2 s0)
   changed: (fuel-used) from 3580 to 4410
   goals met: 5 of 14
18. (drive-truck truck7 s6 s4 driver1)
   deleted: (at truck7 s6)
   added: (at truck7 s4)
   changed: (fuel-used) from 4410 to 5350
   goals met: 6 of 14
19. (drive-truck truck7 s4 s2 driver1)
   deleted: (at truck7 s4)
   added: (at truck7 s2)
   changed: (fuel-used) from 5350 to 5630
   goals met: 5 of 14
20. (load-truck package4 truck7 s2)
   deleted: (at package4 s2)
   added: (in package4 truck7)
   changed: (load truck7) from 0 to 1, (fuel-per-minute truck7) from 10 to 11
   goals met: 5 of 14
21. (drive-truck truck7 s2 s10 driver1)
   deleted: (at truck7 s2)
   added: (at truck7 s10)
   changed: (fuel-used) from 5630 to 5817
   goals met: 5 of 14
22. (drive-truck truck7 s10 s1 driver1)
   deleted: (at truck7 s10)
   added: (at truck7 s1)
   changed: (fuel-used) from 5817 to 6444
   goals met: 5 of 14
23. (unload-truck package4 truck7 s1)
   deleted: (in package4 truck7)
   added: (at package4 s1)
   changed: (load truck7) from 1 to 0, (fuel-per-minute truck7) from 11 to 10
   goals met: 6 of 14
24. (disembark-truck driver1 truck7 s1)
   deleted: (driving driver1 truck7)
   added: (at driver1 s1) (empty truck7)
   goals met: 6 of 14
25. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 6444 to 7134
   goals met: 6 of 14
26. (disembark-truck driver2 truck2 s3)
   deleted: (driving driver2 truck2)
   added: (at driver2 s3) (empty truck2)
   goals met: 6 of 14
27. (walk driver2 s3 p3-0)
   deleted: (at driver2 s3)
   added: (at driver2 p3-0)
   goals met: 6 of 14
28. (walk driver2 p3-0 s0)
   deleted: (at driver2 p3-0)
   added: (at driver2 s0)
   goals met: 6 of 14
29. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 6 of 14
30. (drive-truck truck1 s0 s11 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s11)
   changed: (fuel-used) from 7134 to 7604
   goals met: 6 of 14
31. (drive-truck truck1 s11 s4 driver2)
   deleted: (at truck1 s11)
   added: (at truck1 s4)
   changed: (fuel-used) from 7604 to 8354
   goals met: 6 of 14
32. (load-truck package8 truck1 s4)
   deleted: (at package8 s4)
   added: (in package8 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 6 of 14
33. (drive-truck truck1 s4 s3 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   changed: (fuel-used) from 8354 to 8849
   goals met: 6 of 14
34. (drive-truck truck1 s3 s9 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s9)
   changed: (fuel-used) from 8849 to 9509
   goals met: 6 of 14
35. (board-truck driver1 truck4 s1)
   deleted: (at driver1 s1) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 6 of 14
36. (drive-truck truck1 s9 s12 driver2)
   deleted: (at truck1 s9)
   added: (at truck1 s12)
   changed: (fuel-used) from 9509 to 10499
   goals met: 7 of 14
37. (load-truck package7 truck1 s12)
   deleted: (at package7 s12)
   added: (in package7 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 7 of 14
38. (drive-truck truck1 s12 s9 driver2)
   deleted: (at truck1 s12)
   added: (at truck1 s9)
   changed: (fuel-used) from 10499 to 11669
   goals met: 6 of 14
39. (disembark-truck driver1 truck4 s1)
   deleted: (driving driver1 truck4)
   added: (at driver1 s1) (empty truck4)
   goals met: 6 of 14
40. (drive-truck truck1 s9 s2 driver2)
   deleted: (at truck1 s9)
   added: (at truck1 s2)
   changed: (fuel-used) from 11669 to 12462
   goals met: 6 of 14
41. (drive-truck truck1 s2 s10 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s10)
   changed: (fuel-used) from 12462 to 12683
   goals met: 6 of 14
42. (unload-truck package7 truck1 s10)
   deleted: (in package7 truck1)
   added: (at package7 s10)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 7 of 14
43. (drive-truck truck1 s10 s11 driver2)
   deleted: (at truck1 s10)
   added: (at truck1 s11)
   changed: (fuel-used) from 12683 to 12848
   goals met: 7 of 14
44. (drive-truck truck1 s11 s12 driver2)
   deleted: (at truck1 s11)
   added: (at truck1 s12)
   changed: (fuel-used) from 12848 to 13475
   goals met: 8 of 14
45. (board-truck driver1 truck4 s1)
   deleted: (at driver1 s1) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 8 of 14
46. (drive-truck truck4 s1 s3 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (fuel-used) from 13475 to 14225
   goals met: 8 of 14
47. (disembark-truck driver1 truck4 s3)
   deleted: (driving driver1 truck4)
   added: (at driver1 s3) (empty truck4)
   goals met: 8 of 14
48. (board-truck driver1 truck2 s3)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 8 of 14
49. (drive-truck truck2 s3 s1 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (fuel-used) from 14225 to 14975
   goals met: 8 of 14
50. (drive-truck truck1 s12 s9 driver2)
   deleted: (at truck1 s12)
   added: (at truck1 s9)
   changed: (fuel-used) from 14975 to 15965
   goals met: 7 of 14
51. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 7 of 14
52. (board-truck driver1 truck7 s1)
   deleted: (at driver1 s1) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 7 of 14
53. (drive-truck truck1 s9 s12 driver2)
   deleted: (at truck1 s9)
   added: (at truck1 s12)
   changed: (fuel-used) from 15965 to 16955
   goals met: 8 of 14
54. (drive-truck truck7 s1 s3 driver1)
   deleted: (at truck7 s1)
   added: (at truck7 s3)
   changed: (fuel-used) from 16955 to 17705
   goals met: 8 of 14
55. (drive-truck truck1 s12 s11 driver2)
   deleted: (at truck1 s12)
   added: (at truck1 s11)
   changed: (fuel-used) from 17705 to 18332
   goals met: 7 of 14
56. (disembark-truck driver1 truck7 s3)
   deleted: (driving driver1 truck7)
   added: (at driver1 s3) (empty truck7)
   goals met: 7 of 14
57. (board-truck driver1 truck4 s3)
   deleted: (at driver1 s3) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 7 of 14
58. (drive-truck truck4 s3 s9 driver1)
   deleted: (at truck4 s3)
   added: (at truck4 s9)
   changed: (fuel-used) from 18332 to 18932
   goals met: 8 of 14
59. (drive-truck truck1 s11 s1 driver2)
   deleted: (at truck1 s11)
   added: (at truck1 s1)
   changed: (fuel-used) from 18932 to 19251
   goals met: 8 of 14
60. (unload-truck package8 truck1 s1)
   deleted: (in package8 truck1)
   added: (at package8 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 9 of 14
61. (drive-truck truck1 s1 s3 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (fuel-used) from 19251 to 20001
   goals met: 9 of 14
62. (drive-truck truck1 s3 s9 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s9)
   changed: (fuel-used) from 20001 to 20601
   goals met: 9 of 14
63. (disembark-truck driver1 truck4 s9)
   deleted: (driving driver1 truck4)
   added: (at driver1 s9) (empty truck4)
   goals met: 9 of 14
64. (walk driver1 s9 p9-1)
   deleted: (at driver1 s9)
   added: (at driver1 p9-1)
   goals met: 9 of 14
65. (walk driver1 p9-1 s1)
   deleted: (at driver1 p9-1)
   added: (at driver1 s1)
   goals met: 9 of 14
66. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 9 of 14
67. (drive-truck truck2 s1 s3 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 20601 to 21351
   goals met: 9 of 14
68. (disembark-truck driver1 truck2 s3)
   deleted: (driving driver1 truck2)
   added: (at driver1 s3) (empty truck2)
   goals met: 9 of 14
69. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 9 of 14
70. (drive-truck truck3 s3 s4 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   changed: (fuel-used) from 21351 to 21801
   goals met: 10 of 14
71. (drive-truck truck1 s9 s3 driver2)
   deleted: (at truck1 s9)
   added: (at truck1 s3)
   changed: (fuel-used) from 21801 to 22401
   goals met: 10 of 14
72. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 10 of 14
73. (disembark-truck driver1 truck3 s4)
   deleted: (driving driver1 truck3)
   added: (at driver1 s4) (empty truck3)
   goals met: 10 of 14
74. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 10 of 14
75. (drive-truck truck1 s3 s9 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s9)
   changed: (fuel-used) from 22401 to 23001
   goals met: 10 of 14
76. (disembark-truck driver2 truck1 s9)
   deleted: (driving driver2 truck1)
   added: (at driver2 s9) (empty truck1)
   goals met: 11 of 14
77. (walk driver1 s4 p4-3)
   deleted: (at driver1 s4)
   added: (at driver1 p4-3)
   goals met: 11 of 14
78. (walk driver1 p4-3 s3)
   deleted: (at driver1 p4-3)
   added: (at driver1 s3)
   goals met: 11 of 14
79. (board-truck driver2 truck1 s9)
   deleted: (at driver2 s9) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 10 of 14
80. (board-truck driver1 truck2 s3)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 10 of 14
81. (drive-truck truck2 s3 s10 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s10)
   changed: (fuel-used) from 23001 to 23871
   goals met: 11 of 14
82. (drive-truck truck1 s9 s3 driver2)
   deleted: (at truck1 s9)
   added: (at truck1 s3)
   changed: (fuel-used) from 23871 to 24471
   goals met: 11 of 14
83. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 11 of 14
84. (disembark-truck driver1 truck2 s10)
   deleted: (driving driver1 truck2)
   added: (at driver1 s10) (empty truck2)
   goals met: 11 of 14
85. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 11 of 14
86. (drive-truck truck1 s3 s9 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s9)
   changed: (fuel-used) from 24471 to 25071
   goals met: 11 of 14
87. (disembark-truck driver2 truck1 s9)
   deleted: (driving driver2 truck1)
   added: (at driver2 s9) (empty truck1)
   goals met: 12 of 14
88. (board-truck driver2 truck4 s9)
   deleted: (at driver2 s9) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 11 of 14
89. (drive-truck truck4 s9 s3 driver2)
   deleted: (at truck4 s9)
   added: (at truck4 s3)
   changed: (fuel-used) from 25071 to 25671
   goals met: 10 of 14
90. (walk driver1 s10 p10-9)
   deleted: (at driver1 s10)
   added: (at driver1 p10-9)
   goals met: 10 of 14
91. (walk driver1 p10-9 s9)
   deleted: (at driver1 p10-9)
   added: (at driver1 s9)
   goals met: 10 of 14
92. (board-truck driver1 truck1 s9)
   deleted: (at driver1 s9) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 10 of 14
93. (drive-truck truck1 s9 s12 driver1)
   deleted: (at truck1 s9)
   added: (at truck1 s12)
   changed: (fuel-used) from 25671 to 26571
   goals met: 11 of 14
94. (disembark-truck driver2 truck4 s3)
   deleted: (driving driver2 truck4)
   added: (at driver2 s3) (empty truck4)
   goals met: 11 of 14
95. (board-truck driver2 truck7 s3)
   deleted: (at driver2 s3) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 11 of 14
96. (drive-truck truck7 s3 s9 driver2)
   deleted: (at truck7 s3)
   added: (at truck7 s9)
   changed: (fuel-used) from 26571 to 27171
   goals met: 11 of 14
97. (disembark-truck driver2 truck7 s9)
   deleted: (driving driver2 truck7)
   added: (at driver2 s9) (empty truck7)
   goals met: 12 of 14
98. (disembark-truck driver1 truck1 s12)
   deleted: (driving driver1 truck1)
   added: (at driver1 s12) (empty truck1)
   goals met: 12 of 14
99. (walk driver1 s12 p12-3)
   deleted: (at driver1 s12)
   added: (at driver1 p12-3)
   goals met: 12 of 14
100. (walk driver1 p12-3 s3)
   deleted: (at driver1 p12-3)
   added: (at driver1 s3)
   goals met: 12 of 14
101. (board-truck driver1 truck4 s3)
   deleted: (at driver1 s3) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 12 of 14
102. (drive-truck truck4 s3 s9 driver1)
   deleted: (at truck4 s3)
   added: (at truck4 s9)
   changed: (fuel-used) from 27171 to 27771
   goals met: 13 of 14
103. (disembark-truck driver1 truck4 s9)
   deleted: (driving driver1 truck4)
   added: (at driver1 s9) (empty truck4)
   goals met: 13 of 14
104. (board-truck driver1 truck7 s9)
   deleted: (at driver1 s9) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 13 of 14
105. (drive-truck truck7 s9 s3 driver1)
   deleted: (at truck7 s9)
   added: (at truck7 s3)
   changed: (fuel-used) from 27771 to 28371
   goals met: 13 of 14
106. (drive-truck truck7 s3 s4 driver1)
   deleted: (at truck7 s3)
   added: (at truck7 s4)
   changed: (fuel-used) from 28371 to 28821
   goals met: 14 of 14
